mediaMicroservices/output.txt
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 4 connections

  Thread calibration: mean lat.: 76.576ms, rate sampling interval: 487ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/review/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.34ms   17.96ms  87.74ms   86.80%
    Req/Sec   596.68     38.73   672.00     65.69%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.31ms
 75.000%   26.43ms
 90.000%   43.78ms
 99.000%   87.74ms
 99.900%  121.98ms
 99.990%  136.45ms
 99.999%  140.93ms
100.000%  140.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.675     0.000000            1         1.00
       5.251     0.100000         2987         1.11
       6.875     0.200000         5971         1.25
       9.039     0.300000         8962         1.43
      11.463     0.400000        11930         1.67
      14.311     0.500000        14919         2.00
      16.079     0.550000        16407         2.22
      17.999     0.600000        17900         2.50
      20.319     0.650000        19388         2.86
      23.103     0.700000        20881         3.33
      26.431     0.750000        22374         4.00
      28.271     0.775000        23117         4.44
      30.463     0.800000        23861         5.00
      33.055     0.825000        24611         5.71
      35.871     0.850000        25351         6.67
      39.391     0.875000        26098         8.00
      41.375     0.887500        26471         8.89
      43.775     0.900000        26843        10.00
      46.623     0.912500        27217        11.43
      49.567     0.925000        27590        13.33
      52.959     0.937500        27960        16.00
      54.815     0.943750        28147        17.78
      57.311     0.950000        28334        20.00
      59.839     0.956250        28521        22.86
      62.719     0.962500        28706        26.67
      66.303     0.968750        28893        32.00
      68.479     0.971875        28989        35.56
      70.719     0.975000        29081        40.00
      73.215     0.978125        29174        45.71
      76.223     0.981250        29266        53.33
      79.615     0.984375        29358        64.00
      81.855     0.985938        29406        71.11
      83.455     0.987500        29452        80.00
      86.207     0.989062        29498        91.43
      89.151     0.990625        29545       106.67
      92.735     0.992188        29591       128.00
      94.911     0.992969        29615       142.22
      96.959     0.993750        29638       160.00
      98.815     0.994531        29661       182.86
     102.079     0.995313        29685       213.33
     104.831     0.996094        29708       256.00
     106.559     0.996484        29720       284.44
     108.095     0.996875        29731       320.00
     109.503     0.997266        29743       365.71
     111.103     0.997656        29755       426.67
     113.343     0.998047        29766       512.00
     114.367     0.998242        29772       568.89
     115.647     0.998437        29779       640.00
     117.247     0.998633        29784       731.43
     117.951     0.998828        29790       853.33
     122.239     0.999023        29795      1024.00
     123.903     0.999121        29798      1137.78
     124.863     0.999219        29801      1280.00
     126.271     0.999316        29804      1462.86
     129.023     0.999414        29807      1706.67
     130.751     0.999512        29810      2048.00
     130.815     0.999561        29811      2275.56
     131.839     0.999609        29813      2560.00
     133.247     0.999658        29814      2925.71
     133.503     0.999707        29816      3413.33
     134.783     0.999756        29817      4096.00
     135.295     0.999780        29818      4551.11
     135.807     0.999805        29819      5120.00
     135.807     0.999829        29819      5851.43
     136.319     0.999854        29820      6826.67
     136.447     0.999878        29821      8192.00
     136.447     0.999890        29821      9102.22
     140.287     0.999902        29822     10240.00
     140.287     0.999915        29822     11702.86
     140.287     0.999927        29822     13653.33
     140.671     0.999939        29823     16384.00
     140.671     0.999945        29823     18204.44
     140.671     0.999951        29823     20480.00
     140.671     0.999957        29823     23405.71
     140.671     0.999963        29823     27306.67
     140.927     0.999969        29824     32768.00
     140.927     1.000000        29824          inf
#[Mean    =       20.341, StdDeviation   =       17.958]
#[Max     =      140.800, Total count    =        29824]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  35816 requests in 1.00m, 6.28MB read
Requests/sec:    596.91  
Transfer/sec:    107.26KB